In [1]:
import pandas as pd
from persiantools.jdatetime import JalaliDateTime as jd

import datetime as dt
import numpy as np

In [2]:
dateTimeKey='DATE_TIME'
dateKey='DATE'
timeKey='TIME'
idKey='ID'

In [3]:
data=pd.read_csv('result.csv')
data.head()

   INDEX         ID        DATE      TIME
0      0   Alikhani  1401-01-01  10:09:00
1      1   Alikhani  1401-01-01  10:13:00
2      2    Pazooki  1401-01-01  17:17:00
3      3  Aryaeifar  1401-01-01  17:18:00
4      4      Arast  1401-01-15  17:12:00

In [4]:
#reshaping 
uniqueIds=data[idKey].unique()
uniqueDates=data[dateKey].unique()
exportingDataFrame=pd.DataFrame( index=uniqueDates, columns=uniqueIds)
#we will set uniqueIds to columns and uniqueDates to rows to exportingDataFrame

# exportingDataFrame['DATE']=uniqueDates
# for i in range(len(uniqueIds)):
#     #inserting array as null values of dataframe
#     exportingDataFrame[uniqueIds[i]]=pd.Series(data=[[0,3],[5,6]])
exportingDataFrame.head()

,Alikhani,Pazooki,Aryaeifar,Arast,Javadi,Hoseini,AliAryai,Forootan,Motalleb
1401-01-01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1401-01-15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1401-01-06,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1401-01-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
#extract times of id in a date from data and set it to exportingDataFrame
sample=[]
for i in uniqueDates:
    for j in uniqueIds:
        temp=data[data[dateKey]==i][data[idKey]==j]
        exportingDataFrame[j][i]=temp[timeKey].values
#devide 5 by 51 and set it to a then print a

/tmp/ipykernel_41044/1837979581.py:5: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  temp=data[data[dateKey]==i][data[idKey]==j]

In [6]:
exportingDataFrame.head()

,Alikhani,Pazooki,Aryaeifar,Arast,Javadi,Hoseini,AliAryai,Forootan,Motalleb
1401-01-01,"[10:09:00, 10:13:00]",[17:17:00],[17:18:00],[],[],[],[],[],[]
1401-01-15,[],[],[],"[17:12:00, 17:25:00, 17:19:04, 17:15:00]",[],[],[],[],[]
1401-01-06,[],[19:06:00],[17:23:00],"[19:02:00, 19:02:00, 19:02:00]",[],[],[],[],[]
1401-01-07,"[07:53:00, 10:45:00]",[09:12:00],[09:08:00],[09:23:00],[08:17:00],[08:22:00],"[08:53:00, 10:45:00]",[10:03:00],"[10:44:00, 11:54:00, 12:06:00, 13:28:00, 13:29..."

In [7]:
#get subtract of first and last item in items of exportingDataFrame
for i in uniqueIds:
    items=exportingDataFrame[i].values
    temp=[]
    for item in items:
        if item.size>1:
            exit=dt.time.fromisoformat(str(item[-1]))
            enter=dt.time.fromisoformat(str(item[0]))
            fullTime=dt.timedelta(hours=exit.hour-enter.hour, minutes=exit.minute-enter.minute)
        
            temp.append(fullTime.total_seconds()/3600)
        else:
            temp.append(0)
    exportingDataFrame[i]=temp
    # for item in items:
       
    # if not exportingDataFrame[i].empty:
    
    #     exportingDataFrame[i]=exportingDataFrame[i].apply(lambda x: jd.fromisoformat(x[-1])-jd.fromisoformat(x[0]))
exportingDataFrame.head()

,Alikhani,Pazooki,Aryaeifar,Arast,Javadi,Hoseini,AliAryai,Forootan,Motalleb
1401-01-01,0.066667,0,0,0.00,0,0,0.000000,0,0.0
1401-01-15,0.000000,0,0,0.05,0,0,0.000000,0,0.0
1401-01-06,0.000000,0,0,0.00,0,0,0.000000,0,0.0
1401-01-07,2.866667,0,0,0.00,0,0,1.866667,0,4.0

In [8]:
exportingDataFrame.to_excel('result.xlsx')
# exportingDataFrame.head()